Revit 2024 API
ParameterTypeId.ViewportViewName Property
 "View Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ViewportViewName { get; }
Visual Basic
Public Shared ReadOnly Property ViewportViewName As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ViewportViewName {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace